EDT/УТ/src/Documents/ПереносНаВторуюОчередь/ПереносНаВторуюОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереносНаВторуюОчередь</name>
  <registerRecords>InformationRegister.ЗаказыКПереносуНаВторуюОчередь</registerRecords>
  <registerRecords>InformationRegister.ДатыДоставок</registerRecords>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ЗаказыКПереносуНаВторуюОчередь/ЗаказыКПереносуНаВторуюОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаказыКПереносуНаВторуюОчередь</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТипПереноса</name>
    <type>
      <types>EnumRef.ВидыОперацийПереносаЗаказов</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ВидыОперацийПереносаЗаказов/ВидыОперацийПереносаЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПереносаЗаказов</name>
  <enumValues>
    <name>ПереносНаПослезавтра</name>
  </enumValues>
  <enumValues>
    <name>ПереносНаВторуюОчередь</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ПереносНаВторуюОчередь/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Попытка
		ПодключениеКМагазину = Евген.СоздатьПодключениеКИнтернетМагазину(); 
	Исключение
		НормальныйХодВыполнения = Ложь;
		Возврат;
	КонецПопытки;
	
	
	Движения.ЗаказыКПереносуНаВторуюОчередь.Записывать = Истина;
	Движения.ЗаказыКПереносуНаВторуюОчередь.Очистить();
	
	
	СтрокаП = "";
	
	// Вставить содержимое обработчика.
	Для Каждого Тек Из Заказы Цикл
		
		
		СтрокаП = СтрокаП + Тек.заказ.Номер + "," + Символы.ПС;
		
		Нов = Движения.ЗаказыКПереносуНаВторуюОчередь.Добавить();
		Нов.Период = Дата;
		Нов.ДатаПереноса = ДатаПереноса;
		Нов.Заказ = Тек.Заказ;
		Нов.ТипПереноса = Перечисления.ВидыОперацийПереносаЗаказов.ПереносНаВторуюОчередь;
		
		Д = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(Тек.заказ.Номер).ПолучитьОбъект();
		
		Д.Дата = ДатаПереноса;
		
		ЧН = Час(Д.ВремяОтправленияС);
		ЧК = Час(Д.ВремяОтправленияПо);
		
		МН = Минута(Д.ВремяОтправленияС);
		МК = Минута(Д.ВремяОтправленияПо);
		
		ЧН_ = Час(Д.ВремяПрибытияС);
		ЧК_ = Час(Д.ВремяПрибытияПо);
		
		МН_ = Минута(Д.ВремяПрибытияС);
		МК_ = Минута(Д.ВремяПрибытияПо);
		
		
		Д.ВремяОтправленияС = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
		Д.ВремяОтправленияПо = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
		
		Д.ВремяПрибытияС = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
		Д.ВремяПрибытияПо = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
		
		Д.Записать();
		
		УстановитьДатуВАдминке(Тек.Заказ.Номер, ДатаПереноса, ПодключениеКМагазину);
		//УстановитьСтатусСтрижаВАдминке(Тек.Номер);
		
		
		Док = Тек.Заказ.ПолучитьОбъект();
		Док.Дата = ДатаПереноса;
		Док.Записать(РежимЗаписиДокумента.Запись);
		Если Док.Проведен Тогда
			Док.Записать(РежимЗаписиДокумента.Проведение);
		КонецеСли;	
	КонецЦикла;
	
	МасОтпр = Новый Массив;
	
	МасОтпр.Добавить("logist@strizh-logistic.ru");
    //+++++Серегин М.В. 19.01.2016 11:51:27 
    //МасОтпр.Добавить("yuriy.gnedov@strizh-logistic.ru");
    //-----Серегин М.В. 19.01.2016 11:51:28
	//МасОтпр.Добавить("pavel.nechaev@strizh-logistic.ru");
	МасОтпр.Добавить("evgeniy.marochkin@strizh-logistic.ru");
	
	Если Заказы.Количество() <> 0 Тогда
		lem.ОтправитьСообщение(МасОтпр, "Заказы, восстановленные на вторую очередь",СтрокаП,,"Логистическая компания ""Стриж"""); 
	Иначе
		lem.ОтправитьСообщение(МасОтпр, "Заказы, восстановленные на вторую очередь отсутствуют","Заказы, восстановленные на вторую очередь отсутствуют",,"Логистическая компания ""Стриж"""); 
	КонецЕсли;	
КонецПроцедуры


Процедура УстановитьДатуВАдминке(НомерЗ, ДатаЗ, Подкл) Экспорт
	Ткст = "
	|UPDATE _order
	|SET DeliveryDate = '" + Евген.ДатаВSQL(ДатаЗ, Ложь) + "'
	| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    
    ////Серегин М.В. 30.07.2015 17:44:35 старый код
    //Ткст = "
    //|UPDATE _order
    //|SET carid = 0
    //| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
    //|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
    //Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    ////Серегин М.В. 30.07.2015 17:44:39 новый
    Ткст = "
	|EXEC p1c_removeCarriageFromOrder " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    //Серегин М.В. 30.07.2015 17:44:42 
	
КонецПроцедуры	


Процедура УстановитьСтатусСтрижаВАдминке(НомерЗ) Экспорт
	Попытка
		ПодключениеКМагазину = Евген.СоздатьПодключениеКИнтернетМагазину(); 
	Исключение
		НормальныйХодВыполнения = Ложь;
		Возврат;
	КонецПопытки;
	Ткст = "
	|UPDATE _order
	|SET Status = 2
	| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, ПодключениеКМагазину);
КонецПроцедуры
